<a href="https://colab.research.google.com/github/SangamSilwal/Numpy-and-panda/blob/main/Panda1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

A Panda Series is like a column in a table. It is a 1-D array holding data of any type

In [1]:
import pandas as pd
import numpy as np

Series from lists

In [2]:
#string series
country = ['india','nepal','pakistan','USA']
pd.Series(country)

0       india
1       nepal
2    pakistan
3         USA
dtype: object

In [3]:
#integer series
runs = [13,14,17,18,19]
pd.Series(runs)

0    13
1    14
2    17
3    18
4    19
dtype: int64

In [5]:
#custom index
marks = [89,100,67,44,99]
subjects = ["maths","Science","Sociology","politics","FEEE"]
pd.Series(marks,index = subjects)

maths         89
Science      100
Sociology     67
politics      44
FEEE          99
dtype: int64

In [7]:
#setting name of the series
Panda_Series = pd.Series(marks,index = subjects,name = "Marks of the student")
Panda_Series

maths         89
Science      100
Sociology     67
politics      44
FEEE          99
Name: Marks of the student, dtype: int64

Series from Dict

In [8]:
marks = {
    "Science":55,
    "Computer":56,
    "Sociology" : 23,
    "Nepali":100
}
pd.Series(marks,name="Marks from dictionary")

Science       55
Computer      56
Sociology     23
Nepali       100
Name: Marks from dictionary, dtype: int64

Series Attribute

In [12]:
# size
Panda_Series.size

5

In [13]:
#dtype
Panda_Series.dtype

dtype('int64')

In [14]:
#name
Panda_Series.name

'Marks of the student'

In [18]:
#is_unique
pd.Series([11,11,2,3,4,3,4,3]).is_unique

False

In [19]:
#index
run_array = pd.Series([1,2,3,4])
run_array.index

RangeIndex(start=0, stop=4, step=1)

In [21]:
#values
run_array.values

array([1, 2, 3, 4])

Series Using Read_CSV

In [38]:
#with 2 col
print(type(pd.read_csv('/content/kohli_ipl.csv')))  #This is a dataframe
print(type(pd.read_csv('/content/kohli_ipl.csv',index_col='match_no').squeeze()))  #This is a Series
pd.read_csv('/content/kohli_ipl.csv',index_col='match_no').squeeze()

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

match_no
1       1
2      23
3      13
4      12
5       1
       ..
211     0
212    20
213    73
214    25
215     7
Name: runs, Length: 215, dtype: int64

In [41]:
movies = pd.read_csv('/content/bollywood.csv',index_col='movie').squeeze()
movies

movie
Uri: The Surgical Strike                   Vicky Kaushal
Battalion 609                                Vicky Ahuja
The Accidental Prime Minister (film)         Anupam Kher
Why Cheat India                            Emraan Hashmi
Evening Shadows                         Mona Ambegaonkar
                                              ...
Hum Tumhare Hain Sanam                    Shah Rukh Khan
Aankhen (2002 film)                     Amitabh Bachchan
Saathiya (film)                             Vivek Oberoi
Company (film)                                Ajay Devgn
Awara Paagal Deewana                        Akshay Kumar
Name: lead, Length: 1500, dtype: object